#include <Eryoma.h> // Подключаем библиотеку
Eryoma robot; // Создаём экземпляр класса Eryoma 

void setup() {
  robot.setupConnector(1, TrafficLight); // Указываем, что на 1 коннекторе подключён TrafficLight
}

void loop() {
  robot.write(1, 255, 0, 0); // Включаем на 1 коннекторы зелёный светодиод с заданной яркостью(от 0 до 255)
  delay(500); // Задержка 500 мс
  robot.write(1, 0, 255, 0); // Включаем на 1 коннекторы жёлтый светодиод с заданной яркостью(от 0 до 255)
  delay(500); // Задержка 500 мс
  robot.write(1, 0, 0, 255); // Включаем на 1 коннекторы красный светодиод с заданной яркостью(от 0 до 255)
  delay(500); // Задержка 500 мс
}
